<?php

//echo "<pre>";print_r($arr);echo "</pre>";


// echo $year . '是' . $arr[$year] . '年';
?>
<h4>天干地支年別2</h4>
<hr>
<?php

$start = 1024;

//直接改動陣列順序
$sky = [
    '庚',
    '辛',
    '壬',
    '癸',
    '甲',
    '乙',
    '丙',
    '丁',
    '戊',
    '己'
];

$land = [
    '申',
    '酉',
    '戌',
    '亥',
    '子',
    '丑',
    '寅',
    '卯',
    '辰',
    '巳',
    '午',
    '未'
];

$year = 2020;

$arr = [];
for ($i = 1024; $i < 3000; $i++) {
    //$arr[]=$i;
    $arr[$i] = $sky[$i % 10] . $land[$i % 12];
}



echo $year . '是' . $arr[$year] . '年';



?>